#include <stdio.h>
#include <string.h>

int main() {
    // Оголошення масиву прізвищ учнів
    char surnames[][50] = {
        "Прізвище1",
        "Прізвище2",
        "Прізвище3",
        "Прізвище4",
        "Прізвище5",
        "Прізвище6",
        "Прізвище7",
        "Прізвище8",
        "Прізвище9"
    };

    int n; // Порядковий номер учня

    // Запит порядкового номера учня від користувача
    printf("Введіть порядковий номер учня (від 1 до 9): ");
    scanf("%d", &n);

    // Перевірка коректності введеного номера
    if (n > 1 && n < 10) {
        // Виведення прізвища учня за заданим порядковим номером
        printf("Прізвище учня під номером %d: %s\n", n, surnames[n - 1]);
    } else {
        // Повідомлення про помилку, якщо введено некоректний номер
        printf("Некоректний порядковий номер учня.\n");
    }

    return 0;
}
/*
## Програмування
# Лабораторна робота № 3
# Тема
Цикли
# Виконавець
Студент групи KNms1-B23 Боршуляк М.О.

# Банк питань P BANK 03-04
# Завдання 9
Текст завдання

# Код знаходиться в репозиторії:
https://github.com/BorshuliakM/C_Labs/tree/Task_9_3

# Ім'я файлу (файлів)
Task_9_3.c

# Результат виконання програми

*/