#include <stdio.h>
#include <string.h>

int main() {
    // Оголошення масиву прізвищ учнів
    char surnames[][50] = {
        "Боршуляк",
        "Веретко",
        "Волошин",
        "Галатир",
        "Горецький",
        "Дарманський",
        "Осадчук",
        "Студент x",
        "студент z"
    };

    int n; // Порядковий номер учня

    // Запит порядкового номера учня від користувача
    printf("Введіть порядковий номер учня (від 1 до 9): ");
    scanf("%d", &n);

    // Перевірка коректності введеного номера
    if (n > 1 && n < 10) {
        // Виведення прізвища учня за заданим порядковим номером
        printf("Прізвище учня під номером %d: %s\n", n, surnames[n - 1]);
    } else {
        // Повідомлення про помилку, якщо введено некоректний номер
        printf("Некоректний порядковий номер учня.\n");
    }

    return 0;
}
