#include <stdio.h>
#include <stdlib.h>

int fact(int n)
{
    int res = (n == 0) ? 1 : (n * fact(n - 1));
    return res;
}

int main()
{
    int n;
    double a, res;
    printf("Введіть число n = ");
    scanf("%d", &n);
    for (int i = 1; i <= n; i++)
    {
        a += 1.1;
        res += a / fact(i);
    }

    printf("Добуток виразу = %.4lf", res);

    return 0;
}

/*## Програмування
# Лабораторна робота № 4
# Тема
Цикли
# Виконавець
Студент групи KNms1-B23 Боршуляк М.О.

# Банк питань P BANK 03-04
# Завдання 11
Текст завдання
Знайти значення: (100+10cos0.1)(100+10cos0.2)...(100+10cos10)
# Код знаходиться в репозиторії:
https://github.com/BorshuliakM/C_Labs/tree/Task_11_4

# Ім'я файлу (файлів)
Task_11_4.c

# Результат виконання програми
Добуток виразу = 40695146804697340176773226978422313959270009474747719051386321539095091253678780379330654217317754834892373866807440782249975455006770637581473269047507769978024199193255846400797368894342583149395968.00
*/