#include <stdio.h>
#include <stdlib.h>

int main() {
    int *ptr1, *ptr2; // Оголошення двох покажчиків на цілі числа

    // Виділення динамічної пам'яті для першого покажчика і присвоєння значення
    ptr1 = (int *)malloc(sizeof(int));
    if (ptr1 == NULL) {
        printf("Помилка виділення пам'яті для ptr1\n");
        return 1;
    }
    *ptr1 = 42; // Присвоєння довільного значення

    // Виділення динамічної пам'яті для другого покажчика і присвоєння значення
    ptr2 = (int *)malloc(sizeof(int));
    if (ptr2 == NULL) {
        printf("Помилка виділення пам'яті для ptr2\n");
        return 1;
    }
    *ptr2 = 18; // Присвоєння довільного значення

    // Виведення значень, на які вказують покажчики
    printf("Значення ptr1: %d\n", *ptr1);
    printf("Значення ptr2: %d\n", *ptr2);

    // Звільнення виділеної пам'яті
    free(ptr1);
    free(ptr2);

    return 0;
}

