#include <stdio.h>
#include <math.h>

int main()
{
    float a, b, c, x, F;

    printf("Введіть значення a = ");
    scanf("%f", &a);
    printf("Введіть значення b = ");
    scanf("%f", &b);
    printf("Введіть значення c = ");
    scanf("%f", &c);
    printf("Введіть значення x = ");
    scanf("%f", &x);

    if (c < 0 && b != 0)
    {
        F = a * pow(x, 2) + pow(b, 2) * x;
        printf("F = %f", F);
    }
    else if (c > 0 && b == 0)
    {
            F = (x + a) / (x + c);
            printf("F = %f", F);
    }
    else
        F = x / c;
        printf("F = %f", F);
    return 0;
}
/*
## Програмування
# Лабораторна робота № 3
# Тема
Цикли
# Виконавець
Студент групи KNms1-B23 Боршуляк М.О.

# Банк питань P BANK 03-04
# Завдання 6
Текст завдання
11. Дано дійсні числа x , y. Визначити, чи належить точка з координатами x , y зафарбованій частині площини.

# Код знаходиться в репозиторії:
https://github.com/BorshuliakM/C_Labs/tree/Task_6_3

# Ім'я файлу (файлів)
Task_6_3.c

# Результат виконання програми
Введіть значення x = 1
Введіть значення y = 1
Точка [1.0,1.0] належить замальованому об'єкту на площині
*/